cfd/OpenFOAM/incompressible/simpleFoam/04_Validation_NACA0012/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/boundaryConditions"

// ************************************************************************* //

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $turbulentKE;


boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
    
    freestream
    {
        type        slip;
    }

    model
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    symLeft
    {
        type        symmetryPlane;
    }

    symRight
    {
        type        symmetryPlane;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
