cfd/OpenFOAM/incompressible/simpleFoam/04_Validation_NACA0012/system/include/convergenceConditions
// convergence conditions
convergenceCondition_p      1e-2;
convergenceCondition_U      1e-3;
convergenceCondition_k      1e-3;
convergenceCondition_omega  1e-4;
