cfd/OpenFOAM/incompressible/simpleFoam/04_Validation_NACA0012/system/include/materialPoint
// material point coordinates
materialPoint_x 1.0000001;
materialPoint_y 0.0000001;
materialPoint_z 1.0000001;
