cfd/OpenFOAM/incompressible/simpleFoam/04_Validation_NACA0012/system/include/referenceData
// reference data for force coefficient computations
referenceLength     1.0;
referenceArea       1.0;
